{"doc": [{"id":1,"value":"In holding the first World Cup since 2004, the league and players wanted a festival of hockey that showcased the its best players. Two losses and an early exit by the United States isn't what anyone wanted for the sake of interest, but the 23-and-under Team North America put on a show and captured the attention of fans, coaches and players around the tournament.Team North America and the U.S. are out, with Canada and Russia meeting in one semifinal Saturday night and Sweden and Team Europe in the other Sunday afternoon. The quality of play has already been Olympic-level high and should only get better with at least four and potentially five games left.The winners here have been the fans,North America coach Todd McLellan said They've watched some really good hockey in September and that doesn't happen very often The NHL was panned initially for the North American and European all-star teams, but the youngsters' speed, skill and scoring won so many people over that merchandise bearing the logo was almost entirely sold out at Air Canada Centre. Europe won people over by winning, beating the U.S. and the Czech Republic to advance Canada looks like it still has the best collection of players in the world, even without North America's Connor McDavid and Nathan MacKinnon, who orchestrated a magic show on ice. Even the most grizzled old-school fundamental hockey people had to appreciate the way McDavid, MacKinnon, 2016 top pick Auston Matthews and Co. played. The World Cup achieved big-event status in Toronto, with a mostly full arena and buzz around the city. The same can't be said on U.S. TV, as ESPN reported that approximately 770,000 people watched Canada beat Team USA on Tuesday night, the most watched game so far.3 AND OH CANADA: The Sidney Crosby-led Canadians looked so good in their first game that American Hockey Hall of Famer Mike Modano tweeted to cancel the rest of the tournament and give them the trophy. Goalie Carey Price is on, and Canada looks unstoppable as usual FROM RUSSIA WITH GOALS: Alex Ovechkin, Evgeni Malkin and the Russians used quick-strike offense to set up a rivalry showdown with Canada. A win on Canadian ice would go a long way toward moving past the home-ice failure in Sochi.", "title":"World Cup of Hockey delivering on promise of quality play"}]}
