{'id': 1,'title':'World Cup of Hockey delivering on promise of quality play','value': 'In holding the first World Cup since 2004, the league and players wanted a festival of hockey that showcased the its best players. Two losses and an early exit by the United States isn't what anyone wanted for the sake of interest, but the 23-and-under Team North America put on a show and captured the attention of fans, coaches and players around the tournament.Team North America and the U.S. are out, with Canada and Russia meeting in one semifinal Saturday night and Sweden and Team Europe in the other Sunday afternoon. The quality of play has already been Olympic-level high and should only get better with at least four and potentially five games left."The winners here have been the fans," North America coach Todd McLellan said. "They've watched some really good hockey in September and that doesn't happen very often."The NHL was panned initially for the North American and European all-star teams, but the youngsters' speed, skill and scoring won so many people over that merchandise bearing the "NA" logo was almost entirely sold out at Air Canada Centre. Europe won people over by winning, beating the U.S. and the Czech Republic to advance.Two-time Olympic champion Canada has rolled, going 3-0 and outscoring opponents 14-3 along the way, and Sweden has leaned heavily on goaltender Henrik Lundqvist. North America's games against Russia and Sweden were two of the most exciting end-to-end games in recent international history.Commissioner Gary Bettman is proud of how the NHL and NHLPA "revived the World Cup in world-class fashion.""It's been sensational. It's exactly what we expected," Bettman said. "We wanted this to feel like and be a major event. We predicted that the competition would be better than any international tournament to date, that it would have a big-event feel."The World Cup achieved big-event status in Toronto, with a mostly full arena and buzz around the city. The same can't be said on U.S. TV, as ESPN reported that approximately 770,000 people watched Canada beat Team USA on Tuesday night, the most watched game so far.Executive vice president of programming and scheduling Burke Magnus called the Americans' disappointing showing "a lost opportunity.""That's the beauty of live sports," Magnus said by phone Thursday. "That's what makes sort of the unscripted nature of what we do so much fun. We obviously were counting on them to get out of pool play, but they weren't able to do it. But this is the best players in the world."Canada looks like it still has the best collection of players in the world, even without North America's Connor McDavid and Nathan MacKinnon, who orchestrated a magic show on ice. Even the most grizzled old-school fundamental hockey people had to appreciate the way McDavid, MacKinnon, 2016 top pick Auston Matthews and Co. played.McDavid said North America "definitely turned heads." Canada coach Mike Babcock called it "a great way to showcase the NHL" of the future."The North American kids have been a home run for the NHL," Babcock said. "This North American team is a pump in the arm for hockey. It's fantastic."U.S. CAN'T SCORE: In two games before being eliminated, the U.S. scored a total of one goal. Even with Patrick Kane, Joe Pavelski and Zach Parise on the roster, the Americans failed to generate scoring chances and general manager Dean Lombardi and coach John Tortorella had to answer for why they chose size and physicality at the expense of more skill.3 AND OH CANADA: The Sidney Crosby-led Canadians looked so good in their first game that American Hockey Hall of Famer Mike Modano tweeted to cancel the rest of the tournament and give them the trophy. Goalie Carey Price is on, and Canada looks unstoppable as usual."We feel like we can improve," said Crosby, who has won 22 consecutive games with Canada. "I think it's just probably just consistency in every area, just making sure that we're sharp, that we make the plays we need to make."HOW SWEDE IT IS: Lundqvist stopped 81 of 85 shots in two games and is the top reason Sweden can win this. Ten years after leading the Swedes to gold at the 2006 Olympics, "the King" has one last crack at another international title.'}
